Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS506.h
extern volatile ADCON4BITS ADCON4bits __attribute__((__sfr__));

#define ADCON5 ADCON5
extern volatile unsigned int  ADCON5 __attribute__((__sfr__));
__extension__ typedef struct tagADCON5BITS {
  union {
    struct {
      unsigned ADINSEL:6;
      unsigned :4;
      unsigned VREFSEL:3;
    };
    struct {
      unsigned ADINSEL0:1;
      unsigned ADINSEL1:1;
      unsigned ADINSEL2:1;
      unsigned ADINSEL3:1;
      unsigned ADINSEL4:1;
      unsigned ADINSEL5:1;
      unsigned :4;
      unsigned VREFSEL0:1;
      unsigned VREFSEL1:1;
      unsigned VREFSEL2:1;
    };
  };
} ADCON5BITS;
extern volatile ADCON5BITS ADCON5bits __attribute__((__sfr__));

#define ADCON6 ADCON6
extern volatile unsigned int  ADCON6 __attribute__((__sfr__));
typedef struct tagADCON6BITS {
  unsigned :13;
  unsigned RQCONVRT:1;
  unsigned GSWTRG:1;
  unsigned CAL:1;
} ADCON6BITS;
extern volatile ADCON6BITS ADCON6bits __attribute__((__sfr__));

#define ADMOD ADMOD
extern volatile unsigned int  ADMOD __attribute__((__sfr__));
__extension__ typedef struct tagADMODBITS {
  union {
    struct {
      unsigned SH0MOD:2;
      unsigned SH1MOD:2;
      unsigned SH2MOD:2;
      unsigned SH3MOD:2;
      unsigned SH4MOD:2;
    };
    struct {
      unsigned SH0MOD0:1;
      unsigned SH0MOD1:1;
      unsigned SH1MOD0:1;
      unsigned SH1MOD1:1;
      unsigned SH2MOD0:1;
      unsigned SH2MOD1:1;
      unsigned SH3MOD0:1;
      unsigned SH3MOD1:1;
      unsigned SH4MOD0:1;
      unsigned SH4MOD1:1;
    };
  };
} ADMODBITS;
extern volatile ADMODBITS ADMODbits __attribute__((__sfr__));

#define ADALT ADALT
extern volatile unsigned int  ADALT __attribute__((__sfr__));
__extension__ typedef struct tagADALTBITS {
  union {
    struct {
      unsigned SH0ALT:2;
      unsigned SH1ALT:2;
      unsigned SH2ALT:2;
      unsigned SH3ALT:2;
    };
    struct {
      unsigned SH0ALT0:1;
      unsigned SH0ALT1:1;
      unsigned SH1ALT0:1;
      unsigned SH1ALT1:1;
      unsigned SH2ALT0:1;
      unsigned SH2ALT1:1;
      unsigned SH3ALT0:1;
      unsigned SH3ALT1:1;
    };
  };
} ADALTBITS;
extern volatile ADALTBITS ADALTbits __attribute__((__sfr__));

#define ADGIRQENL ADGIRQENL
extern volatile unsigned int  ADGIRQENL __attribute__((__sfr__));
typedef struct tagADGIRQENLBITS {
  unsigned IRQEN0:1;
  unsigned IRQEN1:1;
  unsigned IRQEN2:1;
  unsigned IRQEN3:1;
  unsigned IRQEN4:1;
  unsigned IRQEN5:1;
  unsigned IRQEN6:1;
  unsigned IRQEN7:1;
  unsigned IRQEN8:1;
  unsigned IRQEN9:1;
  unsigned IRQEN10:1;
  unsigned IRQEN11:1;
  unsigned IRQEN12:1;
  unsigned IRQEN13:1;
  unsigned IRQEN14:1;
  unsigned IRQEN15:1;
} ADGIRQENLBITS;
extern volatile ADGIRQENLBITS ADGIRQENLbits __attribute__((__sfr__));

#define ADGIRQENH ADGIRQENH
extern volatile unsigned int  ADGIRQENH __attribute__((__sfr__));
typedef struct tagADGIRQENHBITS {
  unsigned IRQEN16:1;
  unsigned IRQEN17:1;
  unsigned IRQEN18:1;
  unsigned IRQEN19:1;
  unsigned IRQEN20:1;
  unsigned IRQEN21:1;
  unsigned IRQEN22:1;
  unsigned IRQEN23:1;
  unsigned IRQEN24:1;
  unsigned IRQEN25:1;
  unsigned IRQEN26:1;
} ADGIRQENHBITS;
extern volatile ADGIRQENHBITS ADGIRQENHbits __attribute__((__sfr__));

#define ADCSSL ADCSSL
extern volatile unsigned int  ADCSSL __attribute__((__sfr__));
typedef struct tagADCSSLBITS {
  unsigned CSS0:1;
  unsigned CSS1:1;
  unsigned CSS2:1;
  unsigned CSS3:1;
  unsigned CSS4:1;
  unsigned CSS5:1;
  unsigned CSS6:1;
  unsigned CSS7:1;
  unsigned CSS8:1;
  unsigned CSS9:1;
  unsigned CSS10:1;
  unsigned CSS11:1;
  unsigned CSS12:1;
  unsigned CSS13:1;
  unsigned CSS14:1;
  unsigned CSS15:1;
} ADCSSLBITS;
extern volatile ADCSSLBITS ADCSSLbits __attribute__((__sfr__));

#define ADCSSH ADCSSH
extern volatile unsigned int  ADCSSH __attribute__((__sfr__));
typedef struct tagADCSSHBITS {
  unsigned CSS16:1;
  unsigned CSS17:1;
  unsigned CSS18:1;
  unsigned CSS19:1;
  unsigned CSS20:1;
  unsigned CSS21:1;
  unsigned CSS22:1;
  unsigned CSS23:1;
  unsigned CSS24:1;
  unsigned CSS25:1;
  unsigned CSS26:1;
} ADCSSHBITS;
extern volatile ADCSSHBITS ADCSSHbits __attribute__((__sfr__));

#define ADSTATL ADSTATL
extern volatile unsigned int  ADSTATL __attribute__((__sfr__));
typedef struct tagADSTATLBITS {
  unsigned AN0RDY:1;
  unsigned AN1RDY:1;
  unsigned AN2RDY:1;
  unsigned AN3RDY:1;
  unsigned AN4RDY:1;
  unsigned AN5RDY:1;
  unsigned AN6RDY:1;
  unsigned AN7RDY:1;
  unsigned AN8RDY:1;
  unsigned AN9RDY:1;
  unsigned AN10RDY:1;
  unsigned AN11RDY:1;
  unsigned AN12RDY:1;
  unsigned AN13RDY:1;
  unsigned AN14RDY:1;
  unsigned AN15RDY:1;
} ADSTATLBITS;
extern volatile ADSTATLBITS ADSTATLbits __attribute__((__sfr__));

#define ADSTATH ADSTATH
extern volatile unsigned int  ADSTATH __attribute__((__sfr__));
typedef struct tagADSTATHBITS {
  unsigned AN16RDY:1;
  unsigned AN17RDY:1;
  unsigned AN18RDY:1;
  unsigned AN19RDY:1;
  unsigned AN20RDY:1;
  unsigned AN21RDY:1;
  unsigned AN22RDY:1;
  unsigned AN23RDY:1;
  unsigned AN24RDY:1;
  unsigned AN25RDY:1;
  unsigned AN26RDY:1;
} ADSTATHBITS;
extern volatile ADSTATHBITS ADSTATHbits __attribute__((__sfr__));

#define DCMP1ENL DCMP1ENL
extern volatile unsigned int  DCMP1ENL __attribute__((__sfr__));
typedef struct tagDCMP1ENLBITS {
  unsigned CMPEN0:1;
  unsigned CMPEN1:1;
  unsigned CMPEN2:1;
  unsigned CMPEN3:1;
  unsigned CMPEN4:1;
  unsigned CMPEN5:1;
  unsigned CMPEN6:1;
  unsigned CMPEN7:1;
  unsigned CMPEN8:1;
  unsigned CMPEN9:1;
  unsigned CMPEN10:1;
  unsigned CMPEN11:1;
  unsigned CMPEN12:1;
  unsigned CMPEN13:1;
  unsigned CMPEN14:1;
  unsigned CMPEN15:1;
} DCMP1ENLBITS;
extern volatile DCMP1ENLBITS DCMP1ENLbits __attribute__((__sfr__));

#define DCMP1ENH DCMP1ENH
extern volatile unsigned int  DCMP1ENH __attribute__((__sfr__));
typedef struct tagDCMP1ENHBITS {
  unsigned CMPEN16:1;
  unsigned CMPEN17:1;
  unsigned CMPEN18:1;
  unsigned CMPEN19:1;
  unsigned CMPEN20:1;
  unsigned CMPEN21:1;
  unsigned CMPEN22:1;
  unsigned CMPEN23:1;
  unsigned CMPEN24:1;
  unsigned CMPEN25:1;
  unsigned CMPEN26:1;
} DCMP1ENHBITS;
extern volatile DCMP1ENHBITS DCMP1ENHbits __attribute__((__sfr__));

