Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS506.h
/* SPI1CON1 */
#define _PPRE SPI1CON1bits.PPRE
#define _SPRE SPI1CON1bits.SPRE
#define _MSTEN SPI1CON1bits.MSTEN
#define _CKP SPI1CON1bits.CKP
#define _SSEN SPI1CON1bits.SSEN
#define _CKE SPI1CON1bits.CKE
#define _SMP SPI1CON1bits.SMP
#define _MODE16 SPI1CON1bits.MODE16
#define _DISSDO SPI1CON1bits.DISSDO
#define _DISSCK SPI1CON1bits.DISSCK
#define _PPRE0 SPI1CON1bits.PPRE0
#define _PPRE1 SPI1CON1bits.PPRE1
#define _SPRE0 SPI1CON1bits.SPRE0
#define _SPRE1 SPI1CON1bits.SPRE1
#define _SPRE2 SPI1CON1bits.SPRE2

/* SPI1CON2 */
#define _SPIBEN SPI1CON2bits.SPIBEN
#define _FRMDLY SPI1CON2bits.FRMDLY
#define _FRMPOL SPI1CON2bits.FRMPOL
#define _SPIFSD SPI1CON2bits.SPIFSD
#define _FRMEN SPI1CON2bits.FRMEN

/* SPI2STAT */
/* Bitname _SPIRBF cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBF cannot be defined because it is used by more than one SFR */
/* Bitname _SISEL cannot be defined because it is used by more than one SFR */
/* Bitname _SRXMPT cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROV cannot be defined because it is used by more than one SFR */
/* Bitname _SRMPT cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBEC cannot be defined because it is used by more than one SFR */
/* Bitname _SPISIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SPIEN cannot be defined because it is used by more than one SFR */
/* Bitname _SISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _SISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _SISEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBEC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBEC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBEC2 cannot be defined because it is used by more than one SFR */

/* SPI2CON1 */
/* Bitname _PPRE cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE cannot be defined because it is used by more than one SFR */
/* Bitname _MSTEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _MODE16 cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDO cannot be defined because it is used by more than one SFR */
/* Bitname _DISSCK cannot be defined because it is used by more than one SFR */
/* Bitname _PPRE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PPRE1 cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE0 cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE1 cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE2 cannot be defined because it is used by more than one SFR */

/* SPI2CON2 */
/* Bitname _SPIBEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMDLY cannot be defined because it is used by more than one SFR */
/* Bitname _FRMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _SPIFSD cannot be defined because it is used by more than one SFR */
/* Bitname _FRMEN cannot be defined because it is used by more than one SFR */

/* ADCON1 */
#define _FORM ADCON1bits.FORM
#define _ADSIDL ADCON1bits.ADSIDL
#define _ADON ADCON1bits.ADON

/* ADCON2 */
#define _EIE ADCON2bits.EIE
#define _STRGSRC ADCON2bits.STRGSRC
#define _FLTRDLY ADCON2bits.FLTRDLY
#define _EIE0 ADCON2bits.EIE0
#define _EIE1 ADCON2bits.EIE1
#define _EIE2 ADCON2bits.EIE2
#define _STRGSRC0 ADCON2bits.STRGSRC0
#define _STRGSRC1 ADCON2bits.STRGSRC1
#define _STRGSRC2 ADCON2bits.STRGSRC2
#define _STRGSRC3 ADCON2bits.STRGSRC3
#define _STRGSRC4 ADCON2bits.STRGSRC4
#define _FLTRDLY0 ADCON2bits.FLTRDLY0
#define _FLTRDLY1 ADCON2bits.FLTRDLY1
#define _FLTRDLY2 ADCON2bits.FLTRDLY2
#define _FLTRDLY3 ADCON2bits.FLTRDLY3
#define _FLTRDLY4 ADCON2bits.FLTRDLY4

/* ADCON3 */
#define _ADCS ADCON3bits.ADCS
#define _ADCSEL ADCON3bits.ADCSEL
#define _LOWPWR ADCON3bits.LOWPWR
#define _BOOST ADCON3bits.BOOST
#define _ADCS0 ADCON3bits.ADCS0
#define _ADCS1 ADCON3bits.ADCS1
#define _ADCS2 ADCON3bits.ADCS2
#define _ADCS3 ADCON3bits.ADCS3
#define _ADCS4 ADCON3bits.ADCS4
#define _ADCS5 ADCON3bits.ADCS5
#define _ADCS6 ADCON3bits.ADCS6
#define _ADCSEL0 ADCON3bits.ADCSEL0
#define _ADCSEL1 ADCON3bits.ADCSEL1

/* ADCON4 */
#define _SAMC ADCON4bits.SAMC
#define _ADCRDY ADCON4bits.ADCRDY
#define _SAMC0 ADCON4bits.SAMC0
#define _SAMC1 ADCON4bits.SAMC1
#define _SAMC2 ADCON4bits.SAMC2
#define _SAMC3 ADCON4bits.SAMC3
#define _SAMC4 ADCON4bits.SAMC4
#define _SAMC5 ADCON4bits.SAMC5
#define _SAMC6 ADCON4bits.SAMC6
#define _SAMC7 ADCON4bits.SAMC7

/* ADCON5 */
#define _ADINSEL ADCON5bits.ADINSEL
#define _VREFSEL ADCON5bits.VREFSEL
#define _ADINSEL0 ADCON5bits.ADINSEL0
#define _ADINSEL1 ADCON5bits.ADINSEL1
#define _ADINSEL2 ADCON5bits.ADINSEL2
#define _ADINSEL3 ADCON5bits.ADINSEL3
#define _ADINSEL4 ADCON5bits.ADINSEL4
#define _ADINSEL5 ADCON5bits.ADINSEL5
#define _VREFSEL0 ADCON5bits.VREFSEL0
#define _VREFSEL1 ADCON5bits.VREFSEL1
#define _VREFSEL2 ADCON5bits.VREFSEL2

/* ADCON6 */
#define _RQCONVRT ADCON6bits.RQCONVRT
#define _GSWTRG ADCON6bits.GSWTRG
#define _CAL ADCON6bits.CAL

/* ADMOD */
#define _SH0MOD ADMODbits.SH0MOD
#define _SH1MOD ADMODbits.SH1MOD
#define _SH2MOD ADMODbits.SH2MOD
#define _SH3MOD ADMODbits.SH3MOD
#define _SH4MOD ADMODbits.SH4MOD
#define _SH0MOD0 ADMODbits.SH0MOD0
#define _SH0MOD1 ADMODbits.SH0MOD1
#define _SH1MOD0 ADMODbits.SH1MOD0
#define _SH1MOD1 ADMODbits.SH1MOD1
#define _SH2MOD0 ADMODbits.SH2MOD0
#define _SH2MOD1 ADMODbits.SH2MOD1
#define _SH3MOD0 ADMODbits.SH3MOD0
#define _SH3MOD1 ADMODbits.SH3MOD1
#define _SH4MOD0 ADMODbits.SH4MOD0
#define _SH4MOD1 ADMODbits.SH4MOD1

/* ADALT */
#define _SH0ALT ADALTbits.SH0ALT
#define _SH1ALT ADALTbits.SH1ALT
#define _SH2ALT ADALTbits.SH2ALT
#define _SH3ALT ADALTbits.SH3ALT
#define _SH0ALT0 ADALTbits.SH0ALT0
#define _SH0ALT1 ADALTbits.SH0ALT1
#define _SH1ALT0 ADALTbits.SH1ALT0
#define _SH1ALT1 ADALTbits.SH1ALT1
#define _SH2ALT0 ADALTbits.SH2ALT0
#define _SH2ALT1 ADALTbits.SH2ALT1
#define _SH3ALT0 ADALTbits.SH3ALT0
#define _SH3ALT1 ADALTbits.SH3ALT1

/* ADGIRQENL */
#define _IRQEN0 ADGIRQENLbits.IRQEN0
#define _IRQEN1 ADGIRQENLbits.IRQEN1
#define _IRQEN2 ADGIRQENLbits.IRQEN2
#define _IRQEN3 ADGIRQENLbits.IRQEN3
#define _IRQEN4 ADGIRQENLbits.IRQEN4
#define _IRQEN5 ADGIRQENLbits.IRQEN5
#define _IRQEN6 ADGIRQENLbits.IRQEN6
#define _IRQEN7 ADGIRQENLbits.IRQEN7
#define _IRQEN8 ADGIRQENLbits.IRQEN8
#define _IRQEN9 ADGIRQENLbits.IRQEN9
#define _IRQEN10 ADGIRQENLbits.IRQEN10
#define _IRQEN11 ADGIRQENLbits.IRQEN11
#define _IRQEN12 ADGIRQENLbits.IRQEN12
#define _IRQEN13 ADGIRQENLbits.IRQEN13
#define _IRQEN14 ADGIRQENLbits.IRQEN14
#define _IRQEN15 ADGIRQENLbits.IRQEN15

/* ADGIRQENH */
#define _IRQEN16 ADGIRQENHbits.IRQEN16
#define _IRQEN17 ADGIRQENHbits.IRQEN17
#define _IRQEN18 ADGIRQENHbits.IRQEN18
#define _IRQEN19 ADGIRQENHbits.IRQEN19
#define _IRQEN20 ADGIRQENHbits.IRQEN20
#define _IRQEN21 ADGIRQENHbits.IRQEN21
#define _IRQEN22 ADGIRQENHbits.IRQEN22
#define _IRQEN23 ADGIRQENHbits.IRQEN23
#define _IRQEN24 ADGIRQENHbits.IRQEN24
#define _IRQEN25 ADGIRQENHbits.IRQEN25
#define _IRQEN26 ADGIRQENHbits.IRQEN26

