Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS506.h
#define _ADGIRQENH_IRQEN18_POSITION              0x00000002
#define _ADGIRQENH_IRQEN18_MASK                  0x00000004
#define _ADGIRQENH_IRQEN18_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN19_POSITION              0x00000003
#define _ADGIRQENH_IRQEN19_MASK                  0x00000008
#define _ADGIRQENH_IRQEN19_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN20_POSITION              0x00000004
#define _ADGIRQENH_IRQEN20_MASK                  0x00000010
#define _ADGIRQENH_IRQEN20_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN21_POSITION              0x00000005
#define _ADGIRQENH_IRQEN21_MASK                  0x00000020
#define _ADGIRQENH_IRQEN21_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN22_POSITION              0x00000006
#define _ADGIRQENH_IRQEN22_MASK                  0x00000040
#define _ADGIRQENH_IRQEN22_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN23_POSITION              0x00000007
#define _ADGIRQENH_IRQEN23_MASK                  0x00000080
#define _ADGIRQENH_IRQEN23_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN24_POSITION              0x00000008
#define _ADGIRQENH_IRQEN24_MASK                  0x00000100
#define _ADGIRQENH_IRQEN24_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN25_POSITION              0x00000009
#define _ADGIRQENH_IRQEN25_MASK                  0x00000200
#define _ADGIRQENH_IRQEN25_LENGTH                0x00000001

#define _ADGIRQENH_IRQEN26_POSITION              0x0000000A
#define _ADGIRQENH_IRQEN26_MASK                  0x00000400
#define _ADGIRQENH_IRQEN26_LENGTH                0x00000001

#define _ADCSSL_CSS0_POSITION                    0x00000000
#define _ADCSSL_CSS0_MASK                        0x00000001
#define _ADCSSL_CSS0_LENGTH                      0x00000001

#define _ADCSSL_CSS1_POSITION                    0x00000001
#define _ADCSSL_CSS1_MASK                        0x00000002
#define _ADCSSL_CSS1_LENGTH                      0x00000001

#define _ADCSSL_CSS2_POSITION                    0x00000002
#define _ADCSSL_CSS2_MASK                        0x00000004
#define _ADCSSL_CSS2_LENGTH                      0x00000001

#define _ADCSSL_CSS3_POSITION                    0x00000003
#define _ADCSSL_CSS3_MASK                        0x00000008
#define _ADCSSL_CSS3_LENGTH                      0x00000001

#define _ADCSSL_CSS4_POSITION                    0x00000004
#define _ADCSSL_CSS4_MASK                        0x00000010
#define _ADCSSL_CSS4_LENGTH                      0x00000001

#define _ADCSSL_CSS5_POSITION                    0x00000005
#define _ADCSSL_CSS5_MASK                        0x00000020
#define _ADCSSL_CSS5_LENGTH                      0x00000001

#define _ADCSSL_CSS6_POSITION                    0x00000006
#define _ADCSSL_CSS6_MASK                        0x00000040
#define _ADCSSL_CSS6_LENGTH                      0x00000001

#define _ADCSSL_CSS7_POSITION                    0x00000007
#define _ADCSSL_CSS7_MASK                        0x00000080
#define _ADCSSL_CSS7_LENGTH                      0x00000001

#define _ADCSSL_CSS8_POSITION                    0x00000008
#define _ADCSSL_CSS8_MASK                        0x00000100
#define _ADCSSL_CSS8_LENGTH                      0x00000001

#define _ADCSSL_CSS9_POSITION                    0x00000009
#define _ADCSSL_CSS9_MASK                        0x00000200
#define _ADCSSL_CSS9_LENGTH                      0x00000001

#define _ADCSSL_CSS10_POSITION                   0x0000000A
#define _ADCSSL_CSS10_MASK                       0x00000400
#define _ADCSSL_CSS10_LENGTH                     0x00000001

#define _ADCSSL_CSS11_POSITION                   0x0000000B
#define _ADCSSL_CSS11_MASK                       0x00000800
#define _ADCSSL_CSS11_LENGTH                     0x00000001

#define _ADCSSL_CSS12_POSITION                   0x0000000C
#define _ADCSSL_CSS12_MASK                       0x00001000
#define _ADCSSL_CSS12_LENGTH                     0x00000001

#define _ADCSSL_CSS13_POSITION                   0x0000000D
#define _ADCSSL_CSS13_MASK                       0x00002000
#define _ADCSSL_CSS13_LENGTH                     0x00000001

#define _ADCSSL_CSS14_POSITION                   0x0000000E
#define _ADCSSL_CSS14_MASK                       0x00004000
#define _ADCSSL_CSS14_LENGTH                     0x00000001

#define _ADCSSL_CSS15_POSITION                   0x0000000F
#define _ADCSSL_CSS15_MASK                       0x00008000
#define _ADCSSL_CSS15_LENGTH                     0x00000001

#define _ADCSSH_CSS16_POSITION                   0x00000000
#define _ADCSSH_CSS16_MASK                       0x00000001
#define _ADCSSH_CSS16_LENGTH                     0x00000001

#define _ADCSSH_CSS17_POSITION                   0x00000001
#define _ADCSSH_CSS17_MASK                       0x00000002
#define _ADCSSH_CSS17_LENGTH                     0x00000001

#define _ADCSSH_CSS18_POSITION                   0x00000002
#define _ADCSSH_CSS18_MASK                       0x00000004
#define _ADCSSH_CSS18_LENGTH                     0x00000001

#define _ADCSSH_CSS19_POSITION                   0x00000003
#define _ADCSSH_CSS19_MASK                       0x00000008
#define _ADCSSH_CSS19_LENGTH                     0x00000001

#define _ADCSSH_CSS20_POSITION                   0x00000004
#define _ADCSSH_CSS20_MASK                       0x00000010
#define _ADCSSH_CSS20_LENGTH                     0x00000001

#define _ADCSSH_CSS21_POSITION                   0x00000005
#define _ADCSSH_CSS21_MASK                       0x00000020
#define _ADCSSH_CSS21_LENGTH                     0x00000001

#define _ADCSSH_CSS22_POSITION                   0x00000006
#define _ADCSSH_CSS22_MASK                       0x00000040
#define _ADCSSH_CSS22_LENGTH                     0x00000001

#define _ADCSSH_CSS23_POSITION                   0x00000007
#define _ADCSSH_CSS23_MASK                       0x00000080
#define _ADCSSH_CSS23_LENGTH                     0x00000001

#define _ADCSSH_CSS24_POSITION                   0x00000008
#define _ADCSSH_CSS24_MASK                       0x00000100
#define _ADCSSH_CSS24_LENGTH                     0x00000001

#define _ADCSSH_CSS25_POSITION                   0x00000009
#define _ADCSSH_CSS25_MASK                       0x00000200
#define _ADCSSH_CSS25_LENGTH                     0x00000001

#define _ADCSSH_CSS26_POSITION                   0x0000000A
#define _ADCSSH_CSS26_MASK                       0x00000400
#define _ADCSSH_CSS26_LENGTH                     0x00000001

