Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS506.h
#define _DCMP2ENH_CMPEN23_POSITION               0x00000007
#define _DCMP2ENH_CMPEN23_MASK                   0x00000080
#define _DCMP2ENH_CMPEN23_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN24_POSITION               0x00000008
#define _DCMP2ENH_CMPEN24_MASK                   0x00000100
#define _DCMP2ENH_CMPEN24_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN25_POSITION               0x00000009
#define _DCMP2ENH_CMPEN25_MASK                   0x00000200
#define _DCMP2ENH_CMPEN25_LENGTH                 0x00000001

#define _DCMP2ENH_CMPEN26_POSITION               0x0000000A
#define _DCMP2ENH_CMPEN26_MASK                   0x00000400
#define _DCMP2ENH_CMPEN26_LENGTH                 0x00000001

#define _ADFLTR1CON_CHNLID_POSITION              0x00000000
#define _ADFLTR1CON_CHNLID_MASK                  0x0000003F
#define _ADFLTR1CON_CHNLID_LENGTH                0x00000006

#define _ADFLTR1CON_AFRDY_POSITION               0x00000008
#define _ADFLTR1CON_AFRDY_MASK                   0x00000100
#define _ADFLTR1CON_AFRDY_LENGTH                 0x00000001

#define _ADFLTR1CON_AFGIEN_POSITION              0x00000009
#define _ADFLTR1CON_AFGIEN_MASK                  0x00000200
#define _ADFLTR1CON_AFGIEN_LENGTH                0x00000001

#define _ADFLTR1CON_OVRSAM_POSITION              0x0000000A
#define _ADFLTR1CON_OVRSAM_MASK                  0x00001C00
#define _ADFLTR1CON_OVRSAM_LENGTH                0x00000003

#define _ADFLTR1CON_AFEN_POSITION                0x0000000F
#define _ADFLTR1CON_AFEN_MASK                    0x00008000
#define _ADFLTR1CON_AFEN_LENGTH                  0x00000001

#define _ADFLTR1CON_CHNLID0_POSITION             0x00000000
#define _ADFLTR1CON_CHNLID0_MASK                 0x00000001
#define _ADFLTR1CON_CHNLID0_LENGTH               0x00000001

#define _ADFLTR1CON_CHNLID1_POSITION             0x00000001
#define _ADFLTR1CON_CHNLID1_MASK                 0x00000002
#define _ADFLTR1CON_CHNLID1_LENGTH               0x00000001

#define _ADFLTR1CON_CHNLID2_POSITION             0x00000002
#define _ADFLTR1CON_CHNLID2_MASK                 0x00000004
#define _ADFLTR1CON_CHNLID2_LENGTH               0x00000001

#define _ADFLTR1CON_CHNLID3_POSITION             0x00000003
#define _ADFLTR1CON_CHNLID3_MASK                 0x00000008
#define _ADFLTR1CON_CHNLID3_LENGTH               0x00000001

#define _ADFLTR1CON_CHNLID4_POSITION             0x00000004
#define _ADFLTR1CON_CHNLID4_MASK                 0x00000010
#define _ADFLTR1CON_CHNLID4_LENGTH               0x00000001

#define _ADFLTR1CON_CHNLID5_POSITION             0x00000005
#define _ADFLTR1CON_CHNLID5_MASK                 0x00000020
#define _ADFLTR1CON_CHNLID5_LENGTH               0x00000001

#define _ADFLTR1CON_OVRSAM0_POSITION             0x0000000A
#define _ADFLTR1CON_OVRSAM0_MASK                 0x00000400
#define _ADFLTR1CON_OVRSAM0_LENGTH               0x00000001

#define _ADFLTR1CON_OVRSAM1_POSITION             0x0000000B
#define _ADFLTR1CON_OVRSAM1_MASK                 0x00000800
#define _ADFLTR1CON_OVRSAM1_LENGTH               0x00000001

#define _ADFLTR1CON_OVRSAM2_POSITION             0x0000000C
#define _ADFLTR1CON_OVRSAM2_MASK                 0x00001000
#define _ADFLTR1CON_OVRSAM2_LENGTH               0x00000001

#define _ADFLTR2CON_CHNLID_POSITION              0x00000000
#define _ADFLTR2CON_CHNLID_MASK                  0x0000003F
#define _ADFLTR2CON_CHNLID_LENGTH                0x00000006

#define _ADFLTR2CON_AFRDY_POSITION               0x00000008
#define _ADFLTR2CON_AFRDY_MASK                   0x00000100
#define _ADFLTR2CON_AFRDY_LENGTH                 0x00000001

#define _ADFLTR2CON_AFGIEN_POSITION              0x00000009
#define _ADFLTR2CON_AFGIEN_MASK                  0x00000200
#define _ADFLTR2CON_AFGIEN_LENGTH                0x00000001

#define _ADFLTR2CON_OVRSAM_POSITION              0x0000000A
#define _ADFLTR2CON_OVRSAM_MASK                  0x00001C00
#define _ADFLTR2CON_OVRSAM_LENGTH                0x00000003

#define _ADFLTR2CON_AFEN_POSITION                0x0000000F
#define _ADFLTR2CON_AFEN_MASK                    0x00008000
#define _ADFLTR2CON_AFEN_LENGTH                  0x00000001

#define _ADFLTR2CON_CHNLID0_POSITION             0x00000000
#define _ADFLTR2CON_CHNLID0_MASK                 0x00000001
#define _ADFLTR2CON_CHNLID0_LENGTH               0x00000001

#define _ADFLTR2CON_CHNLID1_POSITION             0x00000001
#define _ADFLTR2CON_CHNLID1_MASK                 0x00000002
#define _ADFLTR2CON_CHNLID1_LENGTH               0x00000001

#define _ADFLTR2CON_CHNLID2_POSITION             0x00000002
#define _ADFLTR2CON_CHNLID2_MASK                 0x00000004
#define _ADFLTR2CON_CHNLID2_LENGTH               0x00000001

#define _ADFLTR2CON_CHNLID3_POSITION             0x00000003
#define _ADFLTR2CON_CHNLID3_MASK                 0x00000008
#define _ADFLTR2CON_CHNLID3_LENGTH               0x00000001

#define _ADFLTR2CON_CHNLID4_POSITION             0x00000004
#define _ADFLTR2CON_CHNLID4_MASK                 0x00000010
#define _ADFLTR2CON_CHNLID4_LENGTH               0x00000001

#define _ADFLTR2CON_CHNLID5_POSITION             0x00000005
#define _ADFLTR2CON_CHNLID5_MASK                 0x00000020
#define _ADFLTR2CON_CHNLID5_LENGTH               0x00000001

#define _ADFLTR2CON_OVRSAM0_POSITION             0x0000000A
#define _ADFLTR2CON_OVRSAM0_MASK                 0x00000400
#define _ADFLTR2CON_OVRSAM0_LENGTH               0x00000001

#define _ADFLTR2CON_OVRSAM1_POSITION             0x0000000B
#define _ADFLTR2CON_OVRSAM1_MASK                 0x00000800
#define _ADFLTR2CON_OVRSAM1_LENGTH               0x00000001

#define _ADFLTR2CON_OVRSAM2_POSITION             0x0000000C
#define _ADFLTR2CON_OVRSAM2_MASK                 0x00001000
#define _ADFLTR2CON_OVRSAM2_LENGTH               0x00000001

#define _ADTRIG1_TRGSRC0_POSITION                0x00000000
#define _ADTRIG1_TRGSRC0_MASK                    0x0000001F
#define _ADTRIG1_TRGSRC0_LENGTH                  0x00000005

#define _ADTRIG1_TRGSRC1_POSITION                0x00000008
#define _ADTRIG1_TRGSRC1_MASK                    0x00001F00
#define _ADTRIG1_TRGSRC1_LENGTH                  0x00000005

#define _ADTRIG1_TRGSRC00_POSITION               0x00000000
#define _ADTRIG1_TRGSRC00_MASK                   0x00000001
#define _ADTRIG1_TRGSRC00_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC01_POSITION               0x00000001
#define _ADTRIG1_TRGSRC01_MASK                   0x00000002
#define _ADTRIG1_TRGSRC01_LENGTH                 0x00000001

#define _ADTRIG1_TRGSRC02_POSITION               0x00000002
#define _ADTRIG1_TRGSRC02_MASK                   0x00000004
#define _ADTRIG1_TRGSRC02_LENGTH                 0x00000001

