Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS506.h
#define _ADTRIG4_TRGSRC62_POSITION               0x00000002
#define _ADTRIG4_TRGSRC62_MASK                   0x00000004
#define _ADTRIG4_TRGSRC62_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC63_POSITION               0x00000003
#define _ADTRIG4_TRGSRC63_MASK                   0x00000008
#define _ADTRIG4_TRGSRC63_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC64_POSITION               0x00000004
#define _ADTRIG4_TRGSRC64_MASK                   0x00000010
#define _ADTRIG4_TRGSRC64_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC70_POSITION               0x00000008
#define _ADTRIG4_TRGSRC70_MASK                   0x00000100
#define _ADTRIG4_TRGSRC70_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC71_POSITION               0x00000009
#define _ADTRIG4_TRGSRC71_MASK                   0x00000200
#define _ADTRIG4_TRGSRC71_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC72_POSITION               0x0000000A
#define _ADTRIG4_TRGSRC72_MASK                   0x00000400
#define _ADTRIG4_TRGSRC72_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC73_POSITION               0x0000000B
#define _ADTRIG4_TRGSRC73_MASK                   0x00000800
#define _ADTRIG4_TRGSRC73_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC74_POSITION               0x0000000C
#define _ADTRIG4_TRGSRC74_MASK                   0x00001000
#define _ADTRIG4_TRGSRC74_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC8_POSITION                0x00000000
#define _ADTRIG5_TRGSRC8_MASK                    0x0000001F
#define _ADTRIG5_TRGSRC8_LENGTH                  0x00000005

#define _ADTRIG5_TRGSRC9_POSITION                0x00000008
#define _ADTRIG5_TRGSRC9_MASK                    0x00001F00
#define _ADTRIG5_TRGSRC9_LENGTH                  0x00000005

#define _ADTRIG5_TRGSRC80_POSITION               0x00000000
#define _ADTRIG5_TRGSRC80_MASK                   0x00000001
#define _ADTRIG5_TRGSRC80_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC81_POSITION               0x00000001
#define _ADTRIG5_TRGSRC81_MASK                   0x00000002
#define _ADTRIG5_TRGSRC81_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC82_POSITION               0x00000002
#define _ADTRIG5_TRGSRC82_MASK                   0x00000004
#define _ADTRIG5_TRGSRC82_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC83_POSITION               0x00000003
#define _ADTRIG5_TRGSRC83_MASK                   0x00000008
#define _ADTRIG5_TRGSRC83_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC84_POSITION               0x00000004
#define _ADTRIG5_TRGSRC84_MASK                   0x00000010
#define _ADTRIG5_TRGSRC84_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC90_POSITION               0x00000008
#define _ADTRIG5_TRGSRC90_MASK                   0x00000100
#define _ADTRIG5_TRGSRC90_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC91_POSITION               0x00000009
#define _ADTRIG5_TRGSRC91_MASK                   0x00000200
#define _ADTRIG5_TRGSRC91_LENGTH                 0x00000001

#define _ADTRIG5_TRGSRC92_POSITION               0x0000000A
#define _ADTRIG5_TRGSRC92_MASK                   0x00000400
#define _ADTRIG5_TRGSRC92_LENGTH                 0x00000001

#define _ADTRIG5_TRIGSRC93_POSITION              0x0000000B
#define _ADTRIG5_TRIGSRC93_MASK                  0x00000800
#define _ADTRIG5_TRIGSRC93_LENGTH                0x00000001

#define _ADTRIG5_TRGSRC94_POSITION               0x0000000C
#define _ADTRIG5_TRGSRC94_MASK                   0x00001000
#define _ADTRIG5_TRGSRC94_LENGTH                 0x00000001

#define _ADTRIG6_TRGSRC10_POSITION               0x00000000
#define _ADTRIG6_TRGSRC10_MASK                   0x0000001F
#define _ADTRIG6_TRGSRC10_LENGTH                 0x00000005

#define _ADTRIG6_TRGSRC11_POSITION               0x00000008
#define _ADTRIG6_TRGSRC11_MASK                   0x00001F00
#define _ADTRIG6_TRGSRC11_LENGTH                 0x00000005

#define _ADTRIG6_TRGSRC100_POSITION              0x00000000
#define _ADTRIG6_TRGSRC100_MASK                  0x00000001
#define _ADTRIG6_TRGSRC100_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC101_POSITION              0x00000001
#define _ADTRIG6_TRGSRC101_MASK                  0x00000002
#define _ADTRIG6_TRGSRC101_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC102_POSITION              0x00000002
#define _ADTRIG6_TRGSRC102_MASK                  0x00000004
#define _ADTRIG6_TRGSRC102_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC103_POSITION              0x00000003
#define _ADTRIG6_TRGSRC103_MASK                  0x00000008
#define _ADTRIG6_TRGSRC103_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC104_POSITION              0x00000004
#define _ADTRIG6_TRGSRC104_MASK                  0x00000010
#define _ADTRIG6_TRGSRC104_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC110_POSITION              0x00000008
#define _ADTRIG6_TRGSRC110_MASK                  0x00000100
#define _ADTRIG6_TRGSRC110_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC111_POSITION              0x00000009
#define _ADTRIG6_TRGSRC111_MASK                  0x00000200
#define _ADTRIG6_TRGSRC111_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC112_POSITION              0x0000000A
#define _ADTRIG6_TRGSRC112_MASK                  0x00000400
#define _ADTRIG6_TRGSRC112_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC113_POSITION              0x0000000B
#define _ADTRIG6_TRGSRC113_MASK                  0x00000800
#define _ADTRIG6_TRGSRC113_LENGTH                0x00000001

#define _ADTRIG6_TRGSRC114_POSITION              0x0000000C
#define _ADTRIG6_TRGSRC114_MASK                  0x00001000
#define _ADTRIG6_TRGSRC114_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC12_POSITION               0x00000000
#define _ADTRIG7_TRGSRC12_MASK                   0x0000001F
#define _ADTRIG7_TRGSRC12_LENGTH                 0x00000005

#define _ADTRIG7_TRGSRC13_POSITION               0x00000008
#define _ADTRIG7_TRGSRC13_MASK                   0x00001F00
#define _ADTRIG7_TRGSRC13_LENGTH                 0x00000005

#define _ADTRIG7_TRGSRC120_POSITION              0x00000000
#define _ADTRIG7_TRGSRC120_MASK                  0x00000001
#define _ADTRIG7_TRGSRC120_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC121_POSITION              0x00000001
#define _ADTRIG7_TRGSRC121_MASK                  0x00000002
#define _ADTRIG7_TRGSRC121_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC122_POSITION              0x00000002
#define _ADTRIG7_TRGSRC122_MASK                  0x00000004
#define _ADTRIG7_TRGSRC122_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC123_POSITION              0x00000003
#define _ADTRIG7_TRGSRC123_MASK                  0x00000008
#define _ADTRIG7_TRGSRC123_LENGTH                0x00000001

#define _ADTRIG7_TRGSRC124_POSITION              0x00000004
#define _ADTRIG7_TRGSRC124_MASK                  0x00000010
#define _ADTRIG7_TRGSRC124_LENGTH                0x00000001

