Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS506.h
#define _IFS7_ADCAN6IF_POSITION                  0x00000004
#define _IFS7_ADCAN6IF_MASK                      0x00000010
#define _IFS7_ADCAN6IF_LENGTH                    0x00000001

#define _IFS7_ADCAN7IF_POSITION                  0x00000005
#define _IFS7_ADCAN7IF_MASK                      0x00000020
#define _IFS7_ADCAN7IF_LENGTH                    0x00000001

#define _IFS8_ICDIF_POSITION                     0x0000000E
#define _IFS8_ICDIF_MASK                         0x00004000
#define _IFS8_ICDIF_LENGTH                       0x00000001

#define _IFS8_JTAGIF_POSITION                    0x0000000F
#define _IFS8_JTAGIF_MASK                        0x00008000
#define _IFS8_JTAGIF_LENGTH                      0x00000001

#define _IFS9_ADCAN8IF_POSITION                  0x00000007
#define _IFS9_ADCAN8IF_MASK                      0x00000080
#define _IFS9_ADCAN8IF_LENGTH                    0x00000001

#define _IFS9_ADCAN9IF_POSITION                  0x00000008
#define _IFS9_ADCAN9IF_MASK                      0x00000100
#define _IFS9_ADCAN9IF_LENGTH                    0x00000001

#define _IFS9_ADCAN10IF_POSITION                 0x00000009
#define _IFS9_ADCAN10IF_MASK                     0x00000200
#define _IFS9_ADCAN10IF_LENGTH                   0x00000001

#define _IFS9_ADCAN11IF_POSITION                 0x0000000A
#define _IFS9_ADCAN11IF_MASK                     0x00000400
#define _IFS9_ADCAN11IF_LENGTH                   0x00000001

#define _IFS9_ADCAN12IF_POSITION                 0x0000000B
#define _IFS9_ADCAN12IF_MASK                     0x00000800
#define _IFS9_ADCAN12IF_LENGTH                   0x00000001

#define _IFS9_ADCAN13IF_POSITION                 0x0000000C
#define _IFS9_ADCAN13IF_MASK                     0x00001000
#define _IFS9_ADCAN13IF_LENGTH                   0x00000001

#define _IFS9_ADCAN14IF_POSITION                 0x0000000D
#define _IFS9_ADCAN14IF_MASK                     0x00002000
#define _IFS9_ADCAN14IF_LENGTH                   0x00000001

#define _IFS9_ADCAN15IF_POSITION                 0x0000000E
#define _IFS9_ADCAN15IF_MASK                     0x00004000
#define _IFS9_ADCAN15IF_LENGTH                   0x00000001

#define _IFS9_ADCAN16IF_POSITION                 0x0000000F
#define _IFS9_ADCAN16IF_MASK                     0x00008000
#define _IFS9_ADCAN16IF_LENGTH                   0x00000001

#define _IFS10_ADCAN17IF_POSITION                0x00000000
#define _IFS10_ADCAN17IF_MASK                    0x00000001
#define _IFS10_ADCAN17IF_LENGTH                  0x00000001

#define _IFS10_ADCAN18IF_POSITION                0x00000001
#define _IFS10_ADCAN18IF_MASK                    0x00000002
#define _IFS10_ADCAN18IF_LENGTH                  0x00000001

#define _IFS10_ADCAN19IF_POSITION                0x00000002
#define _IFS10_ADCAN19IF_MASK                    0x00000004
#define _IFS10_ADCAN19IF_LENGTH                  0x00000001

#define _IFS10_ADCAN20IF_POSITION                0x00000003
#define _IFS10_ADCAN20IF_MASK                    0x00000008
#define _IFS10_ADCAN20IF_LENGTH                  0x00000001

#define _IFS10_ADCAN21IF_POSITION                0x00000004
#define _IFS10_ADCAN21IF_MASK                    0x00000010
#define _IFS10_ADCAN21IF_LENGTH                  0x00000001

#define _IFS10_ADCAN22IF_POSITION                0x00000005
#define _IFS10_ADCAN22IF_MASK                    0x00000020
#define _IFS10_ADCAN22IF_LENGTH                  0x00000001

#define _IFS10_ADCAN23IF_POSITION                0x00000006
#define _IFS10_ADCAN23IF_MASK                    0x00000040
#define _IFS10_ADCAN23IF_LENGTH                  0x00000001

#define _IFS10_ADCAN24IF_POSITION                0x00000007
#define _IFS10_ADCAN24IF_MASK                    0x00000080
#define _IFS10_ADCAN24IF_LENGTH                  0x00000001

#define _IFS10_ADCAN25IF_POSITION                0x00000008
#define _IFS10_ADCAN25IF_MASK                    0x00000100
#define _IFS10_ADCAN25IF_LENGTH                  0x00000001

#define _IFS10_ADCAN26IF_POSITION                0x00000009
#define _IFS10_ADCAN26IF_MASK                    0x00000200
#define _IFS10_ADCAN26IF_LENGTH                  0x00000001

#define _IFS10_I2C1BCIF_POSITION                 0x0000000D
#define _IFS10_I2C1BCIF_MASK                     0x00002000
#define _IFS10_I2C1BCIF_LENGTH                   0x00000001

#define _IFS10_I2C2BCIF_POSITION                 0x0000000E
#define _IFS10_I2C2BCIF_MASK                     0x00004000
#define _IFS10_I2C2BCIF_LENGTH                   0x00000001

#define _IFS11_ADCMP1IF_POSITION                 0x00000001
#define _IFS11_ADCMP1IF_MASK                     0x00000002
#define _IFS11_ADCMP1IF_LENGTH                   0x00000001

#define _IFS11_ADCMP2IF_POSITION                 0x00000002
#define _IFS11_ADCMP2IF_MASK                     0x00000004
#define _IFS11_ADCMP2IF_LENGTH                   0x00000001

#define _IFS11_ADFLTR1IF_POSITION                0x00000003
#define _IFS11_ADFLTR1IF_MASK                    0x00000008
#define _IFS11_ADFLTR1IF_LENGTH                  0x00000001

#define _IFS11_ADFLTR2IF_POSITION                0x00000004
#define _IFS11_ADFLTR2IF_MASK                    0x00000010
#define _IFS11_ADFLTR2IF_LENGTH                  0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000001
#define _IEC0_IC1IE_MASK                         0x00000002
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000002
#define _IEC0_OC1IE_MASK                         0x00000004
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_T1IE_POSITION                      0x00000003
#define _IEC0_T1IE_MASK                          0x00000008
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_IC2IE_POSITION                     0x00000005
#define _IEC0_IC2IE_MASK                         0x00000020
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x00000006
#define _IEC0_OC2IE_MASK                         0x00000040
#define _IEC0_OC2IE_LENGTH                       0x00000001

