Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64GS506.h
/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
*/

/* Register FICD (0xafa8)                               */

extern __attribute__((space(prog))) unsigned int _FICD;
#define _FICD(x) __attribute__((section("__FICD.sec"),space(prog))) unsigned int _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGEC3 and PGED3
**     ICS_PGD2             Communicate on PGEC2 and PGED2
**     ICS_PGD1             Communicate on PGEC1 and PGED1
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
**   BOOTSWP Instruction Enable/Disable bit:
**     BTSWP_ON             BOOTSWP instruction is enabled
**     BTSWP_OFF            BOOTSWP instruction is disabled
**
*/

#define ICS_NONE             0xFFFC
#define ICS_PGD3             0xFFFD
#define ICS_PGD2             0xFFFE
#define ICS_PGD1             0xFFFF

#define JTAGEN_OFF           0xFFDF
#define JTAGEN_ON            0xFFFF

#define BTSWP_ON             0x7FFF
#define BTSWP_OFF            0xFFFF

/* Register FDEVOPT (0xafac)                               */

extern __attribute__((space(prog))) unsigned int _FDEVOPT;
#define _FDEVOPT(x) __attribute__((section("__FDEVOPT.sec"),space(prog))) unsigned int _FDEVOPT = (x);

/*
** Only one invocation of FDEVOPT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT.
** Multiple options may be combined, as shown:
**
** _FDEVOPT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   PWMx Lock Enable bit:
**     PWMLOCK_OFF          PWM registers may be written without key sequence
**     PWMLOCK_ON           Certain PWM registers may only be written after key sequency
**
**   Alternate I2C1 Pin bit:
**     ALTI2C1_ON           I2C1 mapped to ASDA1/ASCL1 pins
**     ALTI2C1_OFF          I2C1 mapped to SDA1/SCL1 pins
**
**   Alternate I2C2 Pin bit:
**     ALTI2C2_ON           I2C2 mapped to ASDA2/ASCL2 pins
**     ALTI2C2_OFF          I2C2 mapped to SDA2/SCL2 pins
**
**   DACx Output Cross Connection bit:
**     DBCC_ON              Interconnects DACOUT1 and DACOUT2
**     DBCC_OFF             No Cross Connection between DAC outputs
**
*/

#define PWMLOCK_OFF          0xFFFE
#define PWMLOCK_ON           0xFFFF

#define ALTI2C1_ON           0xFFF7
#define ALTI2C1_OFF          0xFFFF

#define ALTI2C2_ON           0xFFEF
#define ALTI2C2_OFF          0xFFFF

#define DBCC_ON              0xFFBF
#define DBCC_OFF             0xFFFF

/* Register FALTREG (0xafb0)                               */

extern __attribute__((space(prog))) unsigned int _FALTREG;
#define _FALTREG(x) __attribute__((section("__FALTREG.sec"),space(prog))) unsigned int _FALTREG = (x);

/*
** Only one invocation of FALTREG should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FALTREG.
** Multiple options may be combined, as shown:
**
** _FALTREG( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 1 bits:
**     CTXT1_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT1_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT1_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT1_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT1_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT1_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT1_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT1_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 2 bits:
**     CTXT2_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT2_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT2_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT2_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT2_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT2_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT2_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT2_OFF            Not Assigned
**
*/

#define CTXT1_IPL1           0xFFF8
#define CTXT1_IPL2           0xFFF9
#define CTXT1_IPL3           0xFFFA
#define CTXT1_IPL4           0xFFFB
#define CTXT1_IPL5           0xFFFC
#define CTXT1_IPL6           0xFFFD
#define CTXT1_IPL7           0xFFFE
#define CTXT1_OFF            0xFFFF

#define CTXT2_IPL1           0xFF8F
#define CTXT2_IPL2           0xFF9F
#define CTXT2_IPL3           0xFFAF
#define CTXT2_IPL4           0xFFBF
#define CTXT2_IPL5           0xFFCF
#define CTXT2_IPL6           0xFFDF
#define CTXT2_IPL7           0xFFEF
#define CTXT2_OFF            0xFFFF

/* Register FBTSEQ (0xaffc)                               */

extern __attribute__((space(prog))) unsigned int _FBTSEQ;
#define _FBTSEQ(x) __attribute__((section("__FBTSEQ.sec"),space(prog))) unsigned int _FBTSEQ = (x);

/*
** Only one invocation of FBTSEQ should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBTSEQ.
** Multiple options may be combined, as shown:
**
** _FBTSEQ( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Relative value defining which partition will be active after device Reset; the partition containing a lower boot number will be active:
**
**   The one's complement of BSEQ; must be calculated by the user and written during device programming.:
**
*/



#endif

/* Fuses that are only present in dual panel mode */

#ifdef __DUAL_PARTITION
/* Register FSEC (0x5780)                               */

extern __attribute__((space(prog))) unsigned int _FSEC;
#define _FSEC(x) __attribute__((section("__FSEC.sec"),space(prog))) unsigned int _FSEC = (x);

